Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_RUNCFG_COMP_MAINCLK_SHUTOFF_MASK (0x1U)
#define SLEEPCON0_RUNCFG_COMP_MAINCLK_SHUTOFF_SHIFT (0U)
/*! COMP_MAINCLK_SHUTOFF - VDD2_COMP Domain compute_main_clk Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_COMP_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_COMP_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_COMP_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_SENSEP_MAINCLK_SHUTOFF_MASK (0x2U)
#define SLEEPCON0_RUNCFG_SENSEP_MAINCLK_SHUTOFF_SHIFT (1U)
/*! SENSEP_MAINCLK_SHUTOFF - VDD1_SENSE Domain sense_main_clk Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_SENSEP_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_SENSEP_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_SENSEP_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_SENSES_MAINCLK_SHUTOFF_MASK (0x4U)
#define SLEEPCON0_RUNCFG_SENSES_MAINCLK_SHUTOFF_SHIFT (2U)
/*! SENSES_MAINCLK_SHUTOFF - VDD1_SENSE Domain sense_main_clk_1 Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_SENSES_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_SENSES_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_SENSES_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_RAM0_CLK_SHUTOFF_MASK   (0x8U)
#define SLEEPCON0_RUNCFG_RAM0_CLK_SHUTOFF_SHIFT  (3U)
/*! RAM0_CLK_SHUTOFF - RAM_ARBITER0 common_ram_clk Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_RAM0_CLK_SHUTOFF(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_RAM0_CLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_RAM0_CLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_RAM1_CLK_SHUTOFF_MASK   (0x10U)
#define SLEEPCON0_RUNCFG_RAM1_CLK_SHUTOFF_SHIFT  (4U)
/*! RAM1_CLK_SHUTOFF - RAM_ARBITER1 sense_ram_clk shut off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_RAM1_CLK_SHUTOFF(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_RAM1_CLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_RAM1_CLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_COMN_MAINCLK_SHUTOFF_MASK (0x20U)
#define SLEEPCON0_RUNCFG_COMN_MAINCLK_SHUTOFF_SHIFT (5U)
/*! COMN_MAINCLK_SHUTOFF - VDDN_COM Domain common_vddn_clk Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_COMN_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_COMN_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_COMN_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_MEDIA_MAINCLK_SHUTOFF_MASK (0x40U)
#define SLEEPCON0_RUNCFG_MEDIA_MAINCLK_SHUTOFF_SHIFT (6U)
/*! MEDIA_MAINCLK_SHUTOFF - VDD2_MEDIA and VDDN_MEDIA Domains media_main_clk and media_vddn_clk Shut Off
 *  0b0..Turns on
 *  0b1..Turns off
 */
#define SLEEPCON0_RUNCFG_MEDIA_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_MEDIA_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_MEDIA_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_XTAL_PD_MASK            (0x80U)
#define SLEEPCON0_RUNCFG_XTAL_PD_SHIFT           (7U)
/*! XTAL_PD - Xtal Oscillator Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_XTAL_PD(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_XTAL_PD_SHIFT)) & SLEEPCON0_RUNCFG_XTAL_PD_MASK)

#define SLEEPCON0_RUNCFG_FRO0_PD_MASK            (0x100U)
#define SLEEPCON0_RUNCFG_FRO0_PD_SHIFT           (8U)
/*! FRO0_PD - FRO0 Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_FRO0_PD(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_FRO0_PD_SHIFT)) & SLEEPCON0_RUNCFG_FRO0_PD_MASK)

#define SLEEPCON0_RUNCFG_FRO1_PD_MASK            (0x200U)
#define SLEEPCON0_RUNCFG_FRO1_PD_SHIFT           (9U)
/*! FRO1_PD - FRO1 Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_FRO1_PD(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_FRO1_PD_SHIFT)) & SLEEPCON0_RUNCFG_FRO1_PD_MASK)

#define SLEEPCON0_RUNCFG_FRO2_PD_MASK            (0x400U)
#define SLEEPCON0_RUNCFG_FRO2_PD_SHIFT           (10U)
/*! FRO2_PD - FRO2 Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_FRO2_PD(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_FRO2_PD_SHIFT)) & SLEEPCON0_RUNCFG_FRO2_PD_MASK)

#define SLEEPCON0_RUNCFG_LPOSC_PD_MASK           (0x800U)
#define SLEEPCON0_RUNCFG_LPOSC_PD_SHIFT          (11U)
/*! LPOSC_PD - LPOSC Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_LPOSC_PD(x)             (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_LPOSC_PD_SHIFT)) & SLEEPCON0_RUNCFG_LPOSC_PD_MASK)

#define SLEEPCON0_RUNCFG_PLLANA_PD_MASK          (0x1000U)
#define SLEEPCON0_RUNCFG_PLLANA_PD_SHIFT         (12U)
/*! PLLANA_PD - Main PLL Analog Function Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_PLLANA_PD(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_PLLANA_PD_SHIFT)) & SLEEPCON0_RUNCFG_PLLANA_PD_MASK)

#define SLEEPCON0_RUNCFG_PLLLDO_PD_MASK          (0x2000U)
#define SLEEPCON0_RUNCFG_PLLLDO_PD_SHIFT         (13U)
/*! PLLLDO_PD - Main PLL Internal Regulator Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_PLLLDO_PD(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_PLLLDO_PD_SHIFT)) & SLEEPCON0_RUNCFG_PLLLDO_PD_MASK)

#define SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK       (0x4000U)
#define SLEEPCON0_RUNCFG_AUDPLLANA_PD_SHIFT      (14U)
/*! AUDPLLANA_PD - Audio PLL Analog Function Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_AUDPLLANA_PD(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_AUDPLLANA_PD_SHIFT)) & SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK)

#define SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK       (0x8000U)
#define SLEEPCON0_RUNCFG_AUDPLLLDO_PD_SHIFT      (15U)
/*! AUDPLLLDO_PD - Audio PLL Internal Regulator Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_AUDPLLLDO_PD(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_AUDPLLLDO_PD_SHIFT)) & SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK)

#define SLEEPCON0_RUNCFG_ADC0_PD_MASK            (0x10000U)
#define SLEEPCON0_RUNCFG_ADC0_PD_SHIFT           (16U)
/*! ADC0_PD - ADC0 Power Down
 *  0b0..Powers on
 *  0b1..Powers down
 */
#define SLEEPCON0_RUNCFG_ADC0_PD(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_ADC0_PD_SHIFT)) & SLEEPCON0_RUNCFG_ADC0_PD_MASK)

#define SLEEPCON0_RUNCFG_FRO0_GATE_MASK          (0x20000000U)
#define SLEEPCON0_RUNCFG_FRO0_GATE_SHIFT         (29U)
/*! FRO0_GATE - FRO0 Gating
 *  0b0..Removes gating
 *  0b1..Applies gating
 */
#define SLEEPCON0_RUNCFG_FRO0_GATE(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_FRO0_GATE_SHIFT)) & SLEEPCON0_RUNCFG_FRO0_GATE_MASK)

#define SLEEPCON0_RUNCFG_FRO2_GATE_MASK          (0x80000000U)
#define SLEEPCON0_RUNCFG_FRO2_GATE_SHIFT         (31U)
/*! FRO2_GATE - FRO2 Gating
 *  0b0..Removes gating
 *  0b1..Applies gating
 */
#define SLEEPCON0_RUNCFG_FRO2_GATE(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_FRO2_GATE_SHIFT)) & SLEEPCON0_RUNCFG_FRO2_GATE_MASK)
/*! @} */

/*! @name RUNCFG_SET - RUNCFG Set */
/*! @{ */

