Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_RUNCFG_CLR_SENSEP_MAINCLK_SHUTOFF_MASK (0x2U)
#define SLEEPCON0_RUNCFG_CLR_SENSEP_MAINCLK_SHUTOFF_SHIFT (1U)
/*! SENSEP_MAINCLK_SHUTOFF - VDD1_SENSE Domain sense_main_clk Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_SENSEP_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_SENSEP_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_SENSEP_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_SENSES_MAINCLK_SHUTOFF_MASK (0x4U)
#define SLEEPCON0_RUNCFG_CLR_SENSES_MAINCLK_SHUTOFF_SHIFT (2U)
/*! SENSES_MAINCLK_SHUTOFF - VDD1_SENSE Domain sense_main_clk_1 Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_SENSES_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_SENSES_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_SENSES_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_RAM0_CLK_SHUTOFF_MASK (0x8U)
#define SLEEPCON0_RUNCFG_CLR_RAM0_CLK_SHUTOFF_SHIFT (3U)
/*! RAM0_CLK_SHUTOFF - RAM_ARBITER0 common_ram_clk Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_RAM0_CLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_RAM0_CLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_RAM0_CLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_RAM1_CLK_SHUTOFF_MASK (0x10U)
#define SLEEPCON0_RUNCFG_CLR_RAM1_CLK_SHUTOFF_SHIFT (4U)
/*! RAM1_CLK_SHUTOFF - RAM_ARBITER1 sense_ram_clk Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_RAM1_CLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_RAM1_CLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_RAM1_CLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_COMN_MAINCLK_SHUTOFF_MASK (0x20U)
#define SLEEPCON0_RUNCFG_CLR_COMN_MAINCLK_SHUTOFF_SHIFT (5U)
/*! COMN_MAINCLK_SHUTOFF - VDDN_COM Domain common_vddn_clk Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_COMN_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_COMN_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_COMN_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_MEDIA_MAINCLK_SHUTOFF_MASK (0x40U)
#define SLEEPCON0_RUNCFG_CLR_MEDIA_MAINCLK_SHUTOFF_SHIFT (6U)
/*! MEDIA_MAINCLK_SHUTOFF - VDD2_MEDIA and VDDN_MEDIA Domains media_main_clk and media_vddn_clk Shut Off Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_MEDIA_MAINCLK_SHUTOFF(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_MEDIA_MAINCLK_SHUTOFF_SHIFT)) & SLEEPCON0_RUNCFG_CLR_MEDIA_MAINCLK_SHUTOFF_MASK)

#define SLEEPCON0_RUNCFG_CLR_XTAL_PD_MASK        (0x80U)
#define SLEEPCON0_RUNCFG_CLR_XTAL_PD_SHIFT       (7U)
/*! XTAL_PD - Xtal Oscillator Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_XTAL_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_XTAL_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_XTAL_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_FRO0_PD_MASK        (0x100U)
#define SLEEPCON0_RUNCFG_CLR_FRO0_PD_SHIFT       (8U)
/*! FRO0_PD - FRO0 Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_FRO0_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_FRO0_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_FRO0_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_FRO1_PD_MASK        (0x200U)
#define SLEEPCON0_RUNCFG_CLR_FRO1_PD_SHIFT       (9U)
/*! FRO1_PD - FRO1 Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_FRO1_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_FRO1_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_FRO1_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_FRO2_PD_MASK        (0x400U)
#define SLEEPCON0_RUNCFG_CLR_FRO2_PD_SHIFT       (10U)
/*! FRO2_PD - FRO2 Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_FRO2_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_FRO2_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_FRO2_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_LPOSC_PD_MASK       (0x800U)
#define SLEEPCON0_RUNCFG_CLR_LPOSC_PD_SHIFT      (11U)
/*! LPOSC_PD - LPOSC Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_LPOSC_PD(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_LPOSC_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_LPOSC_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_PLLANA_PD_MASK      (0x1000U)
#define SLEEPCON0_RUNCFG_CLR_PLLANA_PD_SHIFT     (12U)
/*! PLLANA_PD - Main PLL Analog Function Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_PLLANA_PD(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_PLLANA_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_PLLANA_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_PLLLDO_PD_MASK      (0x2000U)
#define SLEEPCON0_RUNCFG_CLR_PLLLDO_PD_SHIFT     (13U)
/*! PLLLDO_PD - Main PLL Internal Regulator Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_PLLLDO_PD(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_PLLLDO_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_PLLLDO_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_AUDPLLANA_PD_MASK   (0x4000U)
#define SLEEPCON0_RUNCFG_CLR_AUDPLLANA_PD_SHIFT  (14U)
/*! AUDPLLANA_PD - Audio PLL Analog Function Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_AUDPLLANA_PD(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_AUDPLLANA_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_AUDPLLANA_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_AUDPLLLDO_PD_MASK   (0x8000U)
#define SLEEPCON0_RUNCFG_CLR_AUDPLLLDO_PD_SHIFT  (15U)
/*! AUDPLLLDO_PD - Audio PLL Internal Regulator Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_AUDPLLLDO_PD(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_AUDPLLLDO_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_AUDPLLLDO_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_ADC0_PD_MASK        (0x10000U)
#define SLEEPCON0_RUNCFG_CLR_ADC0_PD_SHIFT       (16U)
/*! ADC0_PD - ADC0 Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_ADC0_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_ADC0_PD_SHIFT)) & SLEEPCON0_RUNCFG_CLR_ADC0_PD_MASK)

#define SLEEPCON0_RUNCFG_CLR_FRO0_GATE_MASK      (0x20000000U)
#define SLEEPCON0_RUNCFG_CLR_FRO0_GATE_SHIFT     (29U)
/*! FRO0_GATE - FRO0 Gating Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_FRO0_GATE(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_FRO0_GATE_SHIFT)) & SLEEPCON0_RUNCFG_CLR_FRO0_GATE_MASK)

#define SLEEPCON0_RUNCFG_CLR_FRO2_GATE_MASK      (0x80000000U)
#define SLEEPCON0_RUNCFG_CLR_FRO2_GATE_SHIFT     (31U)
/*! FRO2_GATE - FRO2 Gating Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_RUNCFG_CLR_FRO2_GATE(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_RUNCFG_CLR_FRO2_GATE_SHIFT)) & SLEEPCON0_RUNCFG_CLR_FRO2_GATE_MASK)
/*! @} */

/*! @name WAKEUPEN0 - Wakeup Enable 0 */
/*! @{ */

#define SLEEPCON0_WAKEUPEN0_UTICK0_MASK          (0x2U)
#define SLEEPCON0_WAKEUPEN0_UTICK0_SHIFT         (1U)
/*! UTICK0 - UTICK0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_UTICK0(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_UTICK0_SHIFT)) & SLEEPCON0_WAKEUPEN0_UTICK0_MASK)

#define SLEEPCON0_WAKEUPEN0_CTIMER0_MASK         (0x8U)
#define SLEEPCON0_WAKEUPEN0_CTIMER0_SHIFT        (3U)
/*! CTIMER0 - CTIMER0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_CTIMER0(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CTIMER0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CTIMER0_MASK)

#define SLEEPCON0_WAKEUPEN0_CTIMER1_MASK         (0x10U)
#define SLEEPCON0_WAKEUPEN0_CTIMER1_SHIFT        (4U)
/*! CTIMER1 - CTIMER1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_CTIMER1(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CTIMER1_SHIFT)) & SLEEPCON0_WAKEUPEN0_CTIMER1_MASK)

#define SLEEPCON0_WAKEUPEN0_CTIMER3_MASK         (0x40U)
#define SLEEPCON0_WAKEUPEN0_CTIMER3_SHIFT        (6U)
/*! CTIMER3 - CTIMER3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_CTIMER3(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CTIMER3_SHIFT)) & SLEEPCON0_WAKEUPEN0_CTIMER3_MASK)

#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM0_MASK    (0x80U)
#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM0_SHIFT   (7U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM0(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM0_SHIFT)) & SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM0_MASK)

#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM1_MASK    (0x100U)
#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM1_SHIFT   (8U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM1(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM1_SHIFT)) & SLEEPCON0_WAKEUPEN0_LP_FLEXCOMM1_MASK)

