Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH10_MASK      (0x20U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH10_SHIFT     (5U)
/*! EDMA0_CH10 - eDMA0 Channel 10 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH10(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH10_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH10_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA0_CH11_MASK      (0x40U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH11_SHIFT     (6U)
/*! EDMA0_CH11 - eDMA0 Channel 11 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH11(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH11_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH11_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA0_CH12_MASK      (0x80U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH12_SHIFT     (7U)
/*! EDMA0_CH12 - eDMA0 Channel 12 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH12(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH12_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH12_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA0_CH13_MASK      (0x100U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH13_SHIFT     (8U)
/*! EDMA0_CH13 - eDMA0 Channel 13 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH13(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH13_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH13_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA0_CH14_MASK      (0x200U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH14_SHIFT     (9U)
/*! EDMA0_CH14 - eDMA0 Channel 14 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH14(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH14_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH14_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA0_CH15_MASK      (0x400U)
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH15_SHIFT     (10U)
/*! EDMA0_CH15 - eDMA0 Channel 15 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA0_CH15(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA0_CH15_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA0_CH15_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH0_MASK       (0x800U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH0_SHIFT      (11U)
/*! EDMA1_CH0 - eDMA1 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH0_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH1_MASK       (0x1000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH1_SHIFT      (12U)
/*! EDMA1_CH1 - eDMA1 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH1_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH2_MASK       (0x2000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH2_SHIFT      (13U)
/*! EDMA1_CH2 - eDMA1 Channel 2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH2(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH2_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH2_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH3_MASK       (0x4000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH3_SHIFT      (14U)
/*! EDMA1_CH3 - eDMA1 Channel 3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH3(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH3_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH3_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH4_MASK       (0x8000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH4_SHIFT      (15U)
/*! EDMA1_CH4 - eDMA1 Channel 4 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH4(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH4_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH4_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH5_MASK       (0x10000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH5_SHIFT      (16U)
/*! EDMA1_CH5 - eDMA1 Channel 5 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH5(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH5_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH5_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH6_MASK       (0x20000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH6_SHIFT      (17U)
/*! EDMA1_CH6 - eDMA1 Channel 6 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH6(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH6_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH6_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH7_MASK       (0x40000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH7_SHIFT      (18U)
/*! EDMA1_CH7 - eDMA1 Channel 7 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH7(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH7_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH7_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH8_MASK       (0x80000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH8_SHIFT      (19U)
/*! EDMA1_CH8 - eDMA1 Channel 8 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH8(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH8_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH8_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH9_MASK       (0x100000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH9_SHIFT      (20U)
/*! EDMA1_CH9 - eDMA1 Channel 9 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH9(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH9_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH9_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH10_MASK      (0x200000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH10_SHIFT     (21U)
/*! EDMA1_CH10 - eDMA1 Channel 10 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH10(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH10_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH10_MASK)

