Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH11_MASK      (0x400000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH11_SHIFT     (22U)
/*! EDMA1_CH11 - eDMA1 Channel 11 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH11(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH11_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH11_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH12_MASK      (0x800000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH12_SHIFT     (23U)
/*! EDMA1_CH12 - eDMA1 Channel 12 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH12(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH12_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH12_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH13_MASK      (0x1000000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH13_SHIFT     (24U)
/*! EDMA1_CH13 - eDMA1 Channel 13 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH13(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH13_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH13_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH14_MASK      (0x2000000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH14_SHIFT     (25U)
/*! EDMA1_CH14 - eDMA1 Channel 14 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH14(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH14_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH14_MASK)

#define SLEEPCON0_WAKEUPEN2_EDMA1_CH15_MASK      (0x4000000U)
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH15_SHIFT     (26U)
/*! EDMA1_CH15 - eDMA1 Channel 15 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_EDMA1_CH15(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_EDMA1_CH15_SHIFT)) & SLEEPCON0_WAKEUPEN2_EDMA1_CH15_MASK)

#define SLEEPCON0_WAKEUPEN2_GPIO0_CH0_MASK       (0x8000000U)
#define SLEEPCON0_WAKEUPEN2_GPIO0_CH0_SHIFT      (27U)
/*! GPIO0_CH0 - GPIO0 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_GPIO0_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_GPIO0_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_GPIO0_CH0_MASK)

#define SLEEPCON0_WAKEUPEN2_GPIO0_CH1_MASK       (0x10000000U)
#define SLEEPCON0_WAKEUPEN2_GPIO0_CH1_SHIFT      (28U)
/*! GPIO0_CH1 - GPIO0 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_GPIO0_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_GPIO0_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN2_GPIO0_CH1_MASK)

#define SLEEPCON0_WAKEUPEN2_GPIO1_CH0_MASK       (0x20000000U)
#define SLEEPCON0_WAKEUPEN2_GPIO1_CH0_SHIFT      (29U)
/*! GPIO1_CH0 - GPIO1 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_GPIO1_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_GPIO1_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_GPIO1_CH0_MASK)

#define SLEEPCON0_WAKEUPEN2_GPIO1_CH1_MASK       (0x40000000U)
#define SLEEPCON0_WAKEUPEN2_GPIO1_CH1_SHIFT      (30U)
/*! GPIO1_CH1 - GPIO1 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_GPIO1_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_GPIO1_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN2_GPIO1_CH1_MASK)

#define SLEEPCON0_WAKEUPEN2_GPIO2_CH0_MASK       (0x80000000U)
#define SLEEPCON0_WAKEUPEN2_GPIO2_CH0_SHIFT      (31U)
/*! GPIO2_CH0 - GPIO2 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN2_GPIO2_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_GPIO2_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_GPIO2_CH0_MASK)
/*! @} */

/*! @name WAKEUPEN3 - Wakeup Enable 3 */
/*! @{ */

#define SLEEPCON0_WAKEUPEN3_GPIO2_CH1_MASK       (0x1U)
#define SLEEPCON0_WAKEUPEN3_GPIO2_CH1_SHIFT      (0U)
/*! GPIO2_CH1 - GPIO2 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO2_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO2_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO2_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO3_CH0_MASK       (0x2U)
#define SLEEPCON0_WAKEUPEN3_GPIO3_CH0_SHIFT      (1U)
/*! GPIO3_CH0 - GPIO3 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO3_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO3_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO3_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO3_CH1_MASK       (0x4U)
#define SLEEPCON0_WAKEUPEN3_GPIO3_CH1_SHIFT      (2U)
/*! GPIO3_CH1 - GPIO3 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO3_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO3_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO3_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO4_CH0_MASK       (0x8U)
#define SLEEPCON0_WAKEUPEN3_GPIO4_CH0_SHIFT      (3U)
/*! GPIO4_CH0 - GPIO4 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO4_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO4_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO4_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO4_CH1_MASK       (0x10U)
#define SLEEPCON0_WAKEUPEN3_GPIO4_CH1_SHIFT      (4U)
/*! GPIO4_CH1 - GPIO4 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO4_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO4_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO4_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO5_CH0_MASK       (0x20U)
#define SLEEPCON0_WAKEUPEN3_GPIO5_CH0_SHIFT      (5U)
/*! GPIO5_CH0 - GPIO5 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO5_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO5_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO5_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO5_CH1_MASK       (0x40U)
#define SLEEPCON0_WAKEUPEN3_GPIO5_CH1_SHIFT      (6U)
/*! GPIO5_CH1 - GPIO5 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO5_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO5_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO5_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO6_CH0_MASK       (0x80U)
#define SLEEPCON0_WAKEUPEN3_GPIO6_CH0_SHIFT      (7U)
/*! GPIO6_CH0 - GPIO6 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO6_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO6_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO6_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO6_CH1_MASK       (0x100U)
#define SLEEPCON0_WAKEUPEN3_GPIO6_CH1_SHIFT      (8U)
/*! GPIO6_CH1 - GPIO6 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO6_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO6_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO6_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO7_CH0_MASK       (0x200U)
#define SLEEPCON0_WAKEUPEN3_GPIO7_CH0_SHIFT      (9U)
/*! GPIO7_CH0 - GPIO7 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO7_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO7_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO7_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_GPIO7_CH1_MASK       (0x400U)
#define SLEEPCON0_WAKEUPEN3_GPIO7_CH1_SHIFT      (10U)
/*! GPIO7_CH1 - GPIO7 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_GPIO7_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_GPIO7_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_GPIO7_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR0_MASK     (0x800U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR0_SHIFT    (11U)
/*! PINT0_INTR0 - PINT0_INTR0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR0_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR0_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR1_MASK     (0x1000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR1_SHIFT    (12U)
/*! PINT0_INTR1 - PINT0_INTR1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR1(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR1_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR1_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR2_MASK     (0x2000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR2_SHIFT    (13U)
/*! PINT0_INTR2 - PINT0_INTR2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR2(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR2_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR2_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR3_MASK     (0x4000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR3_SHIFT    (14U)
/*! PINT0_INTR3 - PINT0_INTR3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR3(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR3_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR3_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR4_MASK     (0x8000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR4_SHIFT    (15U)
/*! PINT0_INTR4 - PINT0_INTR4 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR4(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR4_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR4_MASK)

