Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN1_SET_USBPHY0_MASK     (0x1000U)
#define SLEEPCON0_WAKEUPEN1_SET_USBPHY0_SHIFT    (12U)
/*! USBPHY0 - USBPHY0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_USBPHY0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_USBPHY0_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_USBPHY0_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_PMIC_IRQN_MASK   (0x4000U)
#define SLEEPCON0_WAKEUPEN1_SET_PMIC_IRQN_SHIFT  (14U)
/*! PMIC_IRQN - PMIC_IRQN Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_PMIC_IRQN(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_PMIC_IRQN_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_PMIC_IRQN_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM8_MASK (0x8000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM8_SHIFT (15U)
/*! LP_FLEXCOMM8 - LP_FLEXCOMM8 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM8(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM8_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM8_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM9_MASK (0x10000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM9_SHIFT (16U)
/*! LP_FLEXCOMM9 - LP_FLEXCOMM9 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM9(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM9_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM9_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM10_MASK (0x20000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM10_SHIFT (17U)
/*! LP_FLEXCOMM10 - LP_FLEXCOMM10 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM10(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM10_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM10_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM11_MASK (0x40000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM11_SHIFT (18U)
/*! LP_FLEXCOMM11 - LP_FLEXCOMM11 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM11(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM11_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM11_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM12_MASK (0x80000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM12_SHIFT (19U)
/*! LP_FLEXCOMM12 - LP_FLEXCOMM12 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM12(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM12_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM12_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM13_MASK (0x100000U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM13_SHIFT (20U)
/*! LP_FLEXCOMM13 - LP_FLEXCOMM13 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM13(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM13_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM13_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LPSPI16_MASK     (0x200000U)
#define SLEEPCON0_WAKEUPEN1_SET_LPSPI16_SHIFT    (21U)
/*! LPSPI16 - LPSPI16 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LPSPI16(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LPSPI16_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LPSPI16_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_I3C1_MASK        (0x400000U)
#define SLEEPCON0_WAKEUPEN1_SET_I3C1_SHIFT       (22U)
/*! I3C1 - I3C1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_I3C1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_I3C1_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_I3C1_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_FLEXIO_MASK      (0x800000U)
#define SLEEPCON0_WAKEUPEN1_SET_FLEXIO_SHIFT     (23U)
/*! FLEXIO - FLEXIO Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_FLEXIO(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_FLEXIO_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_FLEXIO_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH0_MASK   (0x8000000U)
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH0_SHIFT  (27U)
/*! EDMA0_CH0 - eDMA0 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH0_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH1_MASK   (0x10000000U)
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH1_SHIFT  (28U)
/*! EDMA0_CH1 - eDMA0 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH1_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH2_MASK   (0x20000000U)
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH2_SHIFT  (29U)
/*! EDMA0_CH2 - eDMA0 Channel 2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH2(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH2_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH2_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH3_MASK   (0x40000000U)
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH3_SHIFT  (30U)
/*! EDMA0_CH3 - eDMA0 Channel 3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH3(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH3_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH3_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH4_MASK   (0x80000000U)
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH4_SHIFT  (31U)
/*! EDMA0_CH4 - eDMA0 Channel 4 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH4(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH4_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_EDMA0_CH4_MASK)
/*! @} */

/*! @name WAKEUPEN2_SET - Wakeup Enable 2 Set */
/*! @{ */

#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH5_MASK   (0x1U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH5_SHIFT  (0U)
/*! EDMA0_CH5 - eDMA0 Channel 5 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH5(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH5_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH5_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH6_MASK   (0x2U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH6_SHIFT  (1U)
/*! EDMA0_CH6 - eDMA0 Channel 6 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH6(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH6_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH6_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH7_MASK   (0x4U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH7_SHIFT  (2U)
/*! EDMA0_CH7 - eDMA0 Channel 7 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH7(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH7_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA0_CH7_MASK)

