Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO6_CH1_MASK   (0x100U)
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO6_CH1_SHIFT  (8U)
/*! GPIO6_CH1 - GPIO6 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO6_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_GPIO6_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_GPIO6_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH0_MASK   (0x200U)
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH0_SHIFT  (9U)
/*! GPIO7_CH0 - GPIO7 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH1_MASK   (0x400U)
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH1_SHIFT  (10U)
/*! GPIO7_CH1 - GPIO7 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_GPIO7_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR0_MASK (0x800U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR0_SHIFT (11U)
/*! PINT0_INTR0 - PINT0_INTR0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR0(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR0_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR0_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR1_MASK (0x1000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR1_SHIFT (12U)
/*! PINT0_INTR1 - PINT0_INTR1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR1(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR1_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR1_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR2_MASK (0x2000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR2_SHIFT (13U)
/*! PINT0_INTR2 - PINT0_INTR2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR2(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR2_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR2_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR3_MASK (0x4000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR3_SHIFT (14U)
/*! PINT0_INTR3 - PINT0_INTR3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR3(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR3_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR3_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR4_MASK (0x8000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR4_SHIFT (15U)
/*! PINT0_INTR4 - PINT0_INTR4 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR4(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR4_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR4_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR5_MASK (0x10000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR5_SHIFT (16U)
/*! PINT0_INTR5 - PINT0_INTR5 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR5(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR5_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR5_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR6_MASK (0x20000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR6_SHIFT (17U)
/*! PINT0_INTR6 - PINT0_INTR6 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR6(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR6_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR6_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR7_MASK (0x40000U)
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR7_SHIFT (18U)
/*! PINT0_INTR7 - PINT0_INTR7 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR7(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR7_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_PINT0_INTR7_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_SAI0_MASK        (0x80000U)
#define SLEEPCON0_WAKEUPEN3_CLR_SAI0_SHIFT       (19U)
/*! SAI0 - SAI0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_SAI0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_SAI0_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_SAI0_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_SAI1_MASK        (0x100000U)
#define SLEEPCON0_WAKEUPEN3_CLR_SAI1_SHIFT       (20U)
/*! SAI1 - SAI1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_SAI1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_SAI1_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_SAI1_MASK)

#define SLEEPCON0_WAKEUPEN3_CLR_SAI2_MASK        (0x200000U)
#define SLEEPCON0_WAKEUPEN3_CLR_SAI2_SHIFT       (21U)
/*! SAI2 - SAI2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN3_CLR_SAI2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_CLR_SAI2_SHIFT)) & SLEEPCON0_WAKEUPEN3_CLR_SAI2_MASK)
/*! @} */

/*! @name WAKEUPEN4_CLR - Wakeup Enable 4 Clear */
/*! @{ */

#define SLEEPCON0_WAKEUPEN4_CLR_ITRC_MASK        (0x10U)
#define SLEEPCON0_WAKEUPEN4_CLR_ITRC_SHIFT       (4U)
/*! ITRC - ITRC Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN4_CLR_ITRC(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_CLR_ITRC_SHIFT)) & SLEEPCON0_WAKEUPEN4_CLR_ITRC_MASK)

#define SLEEPCON0_WAKEUPEN4_CLR_PMC0_MASK        (0x400U)
#define SLEEPCON0_WAKEUPEN4_CLR_PMC0_SHIFT       (10U)
/*! PMC0 - PMC0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN4_CLR_PMC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_CLR_PMC0_SHIFT)) & SLEEPCON0_WAKEUPEN4_CLR_PMC0_MASK)

#define SLEEPCON0_WAKEUPEN4_CLR_FRO0_MASK        (0x4000000U)
#define SLEEPCON0_WAKEUPEN4_CLR_FRO0_SHIFT       (26U)
/*! FRO0 - FRO0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN4_CLR_FRO0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_CLR_FRO0_SHIFT)) & SLEEPCON0_WAKEUPEN4_CLR_FRO0_MASK)

#define SLEEPCON0_WAKEUPEN4_CLR_FRO1_MASK        (0x8000000U)
#define SLEEPCON0_WAKEUPEN4_CLR_FRO1_SHIFT       (27U)
/*! FRO1 - FRO1 Wake-up Enable
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN4_CLR_FRO1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_CLR_FRO1_SHIFT)) & SLEEPCON0_WAKEUPEN4_CLR_FRO1_MASK)

#define SLEEPCON0_WAKEUPEN4_CLR_FRO2_MASK        (0x10000000U)
#define SLEEPCON0_WAKEUPEN4_CLR_FRO2_SHIFT       (28U)
/*! FRO2 - FRO2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN4_CLR_FRO2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_CLR_FRO2_SHIFT)) & SLEEPCON0_WAKEUPEN4_CLR_FRO2_MASK)
/*! @} */

/*! @name PWRDOWN_WAIT - Power Down Wait */
/*! @{ */

#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR_MASK  (0x1U)
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR_SHIFT (0U)
/*! IGN_FRO0PDR - Ignore FRO0 Power Down Ready Signal
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR_SHIFT)) & SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR_MASK)

#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR_MASK  (0x2U)
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR_SHIFT (1U)
/*! IGN_FRO1PDR - Ignore FRO1 Power Down Ready Signals
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR_SHIFT)) & SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR_MASK)

#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR_MASK  (0x4U)
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR_SHIFT (2U)
/*! IGN_FRO2PDR - Ignore FRO2 Power Down Ready Signals
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR_SHIFT)) & SLEEPCON0_PWRDOWN_WAIT_IGN_FRO2PDR_MASK)

#define SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR_MASK (0x8U)
#define SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR_SHIFT (3U)
/*! IGN_LPOSCPDR - Ignore LPOSC Power Down Ready Signals
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR_SHIFT)) & SLEEPCON0_PWRDOWN_WAIT_IGN_LPOSCPDR_MASK)
/*! @} */

/*! @name HW_WAKE - eDMA Wakeup Enable */
/*! @{ */

#define SLEEPCON0_HW_WAKE_HWWK_SRC1_MASK         (0x2U)
#define SLEEPCON0_HW_WAKE_HWWK_SRC1_SHIFT        (1U)
/*! HWWK_SRC1 - eDMA Wakeup Source 1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_HW_WAKE_HWWK_SRC1(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_HWWK_SRC1_SHIFT)) & SLEEPCON0_HW_WAKE_HWWK_SRC1_MASK)

#define SLEEPCON0_HW_WAKE_HWWK_SRC2_MASK         (0x4U)
#define SLEEPCON0_HW_WAKE_HWWK_SRC2_SHIFT        (2U)
/*! HWWK_SRC2 - eDMA Wakeup Source 2
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_HW_WAKE_HWWK_SRC2(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_HWWK_SRC2_SHIFT)) & SLEEPCON0_HW_WAKE_HWWK_SRC2_MASK)

#define SLEEPCON0_HW_WAKE_HWWK_SRC3_MASK         (0x8U)
#define SLEEPCON0_HW_WAKE_HWWK_SRC3_SHIFT        (3U)
/*! HWWK_SRC3 - eDMA Wakeup source 3
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_HW_WAKE_HWWK_SRC3(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_HWWK_SRC3_SHIFT)) & SLEEPCON0_HW_WAKE_HWWK_SRC3_MASK)

#define SLEEPCON0_HW_WAKE_HWWK_SRC4_MASK         (0x10U)
#define SLEEPCON0_HW_WAKE_HWWK_SRC4_SHIFT        (4U)
/*! HWWK_SRC4 - eDMA Wakeup Source 4
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_HW_WAKE_HWWK_SRC4(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_HWWK_SRC4_SHIFT)) & SLEEPCON0_HW_WAKE_HWWK_SRC4_MASK)
/*! @} */

