Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
/*! @name HW_WAKE_SET - eDMA Wakeup Set */
/*! @{ */

#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC1_SET_MASK (0x2U)
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC1_SET_SHIFT (1U)
/*! HWWK_SRC1_SET - eDMA Wakeup Source 1 Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC1_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_SET_HWWK_SRC1_SET_SHIFT)) & SLEEPCON0_HW_WAKE_SET_HWWK_SRC1_SET_MASK)

#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC2_SET_MASK (0x4U)
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC2_SET_SHIFT (2U)
/*! HWWK_SRC2_SET - eDMA Wakeup Source 2 Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC2_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_SET_HWWK_SRC2_SET_SHIFT)) & SLEEPCON0_HW_WAKE_SET_HWWK_SRC2_SET_MASK)

#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC3_SET_MASK (0x8U)
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC3_SET_SHIFT (3U)
/*! HWWK_SRC3_SET - eDMA Wakeup Source 3 Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC3_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_SET_HWWK_SRC3_SET_SHIFT)) & SLEEPCON0_HW_WAKE_SET_HWWK_SRC3_SET_MASK)

#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC4_SET_MASK (0x10U)
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC4_SET_SHIFT (4U)
/*! HWWK_SRC4_SET - eDMA Wakeup Source 4 Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_HW_WAKE_SET_HWWK_SRC4_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_SET_HWWK_SRC4_SET_SHIFT)) & SLEEPCON0_HW_WAKE_SET_HWWK_SRC4_SET_MASK)
/*! @} */

/*! @name HW_WAKE_CLR - eDMA Wakeup Clear */
/*! @{ */

#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC1_CLR_MASK (0x2U)
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC1_CLR_SHIFT (1U)
/*! HWWK_SRC1_CLR - eDMA Wakeup Source 1 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC1_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_CLR_HWWK_SRC1_CLR_SHIFT)) & SLEEPCON0_HW_WAKE_CLR_HWWK_SRC1_CLR_MASK)

#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC2_CLR_MASK (0x4U)
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC2_CLR_SHIFT (2U)
/*! HWWK_SRC2_CLR - eDMA Wakeup Source 2 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC2_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_CLR_HWWK_SRC2_CLR_SHIFT)) & SLEEPCON0_HW_WAKE_CLR_HWWK_SRC2_CLR_MASK)

#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC3_CLR_MASK (0x8U)
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC3_CLR_SHIFT (3U)
/*! HWWK_SRC3_CLR - eDMA Wakeup Source 3 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC3_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_CLR_HWWK_SRC3_CLR_SHIFT)) & SLEEPCON0_HW_WAKE_CLR_HWWK_SRC3_CLR_MASK)

#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC4_CLR_MASK (0x10U)
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC4_CLR_SHIFT (4U)
/*! HWWK_SRC4_CLR - eDMA Wakeup Source 4 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_HW_WAKE_CLR_HWWK_SRC4_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_HW_WAKE_CLR_HWWK_SRC4_CLR_SHIFT)) & SLEEPCON0_HW_WAKE_CLR_HWWK_SRC4_CLR_MASK)
/*! @} */

/*! @name SHARED_MASK0 - Shared Resources Mask */
/*! @{ */

#define SLEEPCON0_SHARED_MASK0_ADC0_MASK_MASK    (0x1U)
#define SLEEPCON0_SHARED_MASK0_ADC0_MASK_SHIFT   (0U)
/*! ADC0_MASK - ADC0 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_ADC0_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_ADC0_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_ADC0_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_ACMP0_MASK_MASK   (0x2U)
#define SLEEPCON0_SHARED_MASK0_ACMP0_MASK_SHIFT  (1U)
/*! ACMP0_MASK - ACMP0 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_ACMP0_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_ACMP0_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_ACMP0_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_MICFIL_MASK_MASK  (0x4U)
#define SLEEPCON0_SHARED_MASK0_MICFIL_MASK_SHIFT (2U)
/*! MICFIL_MASK - MICFIL Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_MICFIL_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_MICFIL_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_MICFIL_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_LPI2C15_MASK_MASK (0x8U)
#define SLEEPCON0_SHARED_MASK0_LPI2C15_MASK_SHIFT (3U)
/*! LPI2C15_MASK - LPI2C15 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_LPI2C15_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_LPI2C15_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_LPI2C15_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_GDET3_MASK_MASK   (0x20U)
#define SLEEPCON0_SHARED_MASK0_GDET3_MASK_SHIFT  (5U)
/*! GDET3_MASK - GDET3 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_GDET3_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_GDET3_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_GDET3_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_RTC_MASK_MASK     (0x40U)
#define SLEEPCON0_SHARED_MASK0_RTC_MASK_SHIFT    (6U)
/*! RTC_MASK - Mask bit of RTC0 and RTC1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_RTC_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_RTC_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_RTC_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_VGPU_MASK_MASK    (0x10000U)
#define SLEEPCON0_SHARED_MASK0_VGPU_MASK_SHIFT   (16U)
/*! VGPU_MASK - VGPU Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_VGPU_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_VGPU_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_VGPU_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_EZHV_MASK_MASK    (0x20000U)
#define SLEEPCON0_SHARED_MASK0_EZHV_MASK_SHIFT   (17U)
/*! EZHV_MASK - EZH-V Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_EZHV_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_EZHV_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_EZHV_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_XSPI2_MASK_MASK   (0x40000U)
#define SLEEPCON0_SHARED_MASK0_XSPI2_MASK_SHIFT  (18U)
/*! XSPI2_MASK - XSPI2 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_XSPI2_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_XSPI2_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_XSPI2_MASK_MASK)

