Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_SHARED_MASK0_LPSPI14_MASK_MASK (0x80000U)
#define SLEEPCON0_SHARED_MASK0_LPSPI14_MASK_SHIFT (19U)
/*! LPSPI14_MASK - LPSPI14 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_LPSPI14_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_LPSPI14_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_LPSPI14_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_LPSPI16_MASK_MASK (0x100000U)
#define SLEEPCON0_SHARED_MASK0_LPSPI16_MASK_SHIFT (20U)
/*! LPSPI16_MASK - LPSPI16 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_LPSPI16_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_LPSPI16_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_LPSPI16_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_FLEXIO_MASK_MASK  (0x200000U)
#define SLEEPCON0_SHARED_MASK0_FLEXIO_MASK_SHIFT (21U)
/*! FLEXIO_MASK - FLEXIO Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_FLEXIO_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_FLEXIO_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_FLEXIO_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_NIC0_MASK_MASK    (0x400000U)
#define SLEEPCON0_SHARED_MASK0_NIC0_MASK_SHIFT   (22U)
/*! NIC0_MASK - NIC_MEDIA0 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_NIC0_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_NIC0_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_NIC0_MASK_MASK)

#define SLEEPCON0_SHARED_MASK0_NIC1_MASK_MASK    (0x800000U)
#define SLEEPCON0_SHARED_MASK0_NIC1_MASK_SHIFT   (23U)
/*! NIC1_MASK - NIC_MEDIA1 Mask
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_SHARED_MASK0_NIC1_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_NIC1_MASK_SHIFT)) & SLEEPCON0_SHARED_MASK0_NIC1_MASK_MASK)
/*! @} */

/*! @name SHARED_MASK0_SET - Shared Resources Mask Set */
/*! @{ */

#define SLEEPCON0_SHARED_MASK0_SET_ADC0_MASK_SET_MASK (0x1U)
#define SLEEPCON0_SHARED_MASK0_SET_ADC0_MASK_SET_SHIFT (0U)
/*! ADC0_MASK_SET - ADC0 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_ADC0_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_ADC0_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_ADC0_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_ACMP0_MASK_SET_MASK (0x2U)
#define SLEEPCON0_SHARED_MASK0_SET_ACMP0_MASK_SET_SHIFT (1U)
/*! ACMP0_MASK_SET - ACMP0 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_ACMP0_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_ACMP0_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_ACMP0_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_MICFIL_MASK_SET_MASK (0x4U)
#define SLEEPCON0_SHARED_MASK0_SET_MICFIL_MASK_SET_SHIFT (2U)
/*! MICFIL_MASK_SET - MICFIL Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_MICFIL_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_MICFIL_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_MICFIL_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_LPI2C15_MASK_SET_MASK (0x8U)
#define SLEEPCON0_SHARED_MASK0_SET_LPI2C15_MASK_SET_SHIFT (3U)
/*! LPI2C15_MASK_SET - LPI2C15 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_LPI2C15_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_LPI2C15_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_LPI2C15_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_GDET3_MASK_SET_MASK (0x20U)
#define SLEEPCON0_SHARED_MASK0_SET_GDET3_MASK_SET_SHIFT (5U)
/*! GDET3_MASK_SET - GDET3 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_GDET3_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_GDET3_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_GDET3_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_RTC_MASK_SET_MASK (0x40U)
#define SLEEPCON0_SHARED_MASK0_SET_RTC_MASK_SET_SHIFT (6U)
/*! RTC_MASK_SET - RTC0 and RTC1 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_RTC_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_RTC_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_RTC_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_VGPU_MASK_SET_MASK (0x10000U)
#define SLEEPCON0_SHARED_MASK0_SET_VGPU_MASK_SET_SHIFT (16U)
/*! VGPU_MASK_SET - VGPU Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_VGPU_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_VGPU_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_VGPU_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_EZHV_MASK_SET_MASK (0x20000U)
#define SLEEPCON0_SHARED_MASK0_SET_EZHV_MASK_SET_SHIFT (17U)
/*! EZHV_MASK_SET - EZH-V Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_EZHV_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_EZHV_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_EZHV_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_XSPI2_MASK_SET_MASK (0x40000U)
#define SLEEPCON0_SHARED_MASK0_SET_XSPI2_MASK_SET_SHIFT (18U)
/*! XSPI2_MASK_SET - XSPI2 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_XSPI2_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_XSPI2_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_XSPI2_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_LPSPI14_MASK_SET_MASK (0x80000U)
#define SLEEPCON0_SHARED_MASK0_SET_LPSPI14_MASK_SET_SHIFT (19U)
/*! LPSPI14_MASK_SET - LPSPI14 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_LPSPI14_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_LPSPI14_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_LPSPI14_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_LPSPI16_MASK_SET_MASK (0x100000U)
#define SLEEPCON0_SHARED_MASK0_SET_LPSPI16_MASK_SET_SHIFT (20U)
/*! LPSPI16_MASK_SET - LPSPI16 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_LPSPI16_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_LPSPI16_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_LPSPI16_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_FLEXIO_MASK_SET_MASK (0x200000U)
#define SLEEPCON0_SHARED_MASK0_SET_FLEXIO_MASK_SET_SHIFT (21U)
/*! FLEXIO_MASK_SET - FLEXIO Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_FLEXIO_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_FLEXIO_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_FLEXIO_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_NIC0_MASK_SET_MASK (0x400000U)
#define SLEEPCON0_SHARED_MASK0_SET_NIC0_MASK_SET_SHIFT (22U)
/*! NIC0_MASK_SET - NIC_MEDIA0 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_NIC0_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_NIC0_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_NIC0_MASK_SET_MASK)

#define SLEEPCON0_SHARED_MASK0_SET_NIC1_MASK_SET_MASK (0x800000U)
#define SLEEPCON0_SHARED_MASK0_SET_NIC1_MASK_SET_SHIFT (23U)
/*! NIC1_MASK_SET - NIC_MEDIA1 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_SHARED_MASK0_SET_NIC1_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_SET_NIC1_MASK_SET_SHIFT)) & SLEEPCON0_SHARED_MASK0_SET_NIC1_MASK_SET_MASK)
/*! @} */

/*! @name SHARED_MASK0_CLR - Shared Resources Mask Clear */
/*! @{ */

#define SLEEPCON0_SHARED_MASK0_CLR_ADC0_MASK_CLR_MASK (0x1U)
#define SLEEPCON0_SHARED_MASK0_CLR_ADC0_MASK_CLR_SHIFT (0U)
/*! ADC0_MASK_CLR - ADC0 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_ADC0_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_ADC0_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_ADC0_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_ACMP0_MASK_CLR_MASK (0x2U)
#define SLEEPCON0_SHARED_MASK0_CLR_ACMP0_MASK_CLR_SHIFT (1U)
/*! ACMP0_MASK_CLR - ACMP0 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_ACMP0_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_ACMP0_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_ACMP0_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_MICFIL_MASK_CLR_MASK (0x4U)
#define SLEEPCON0_SHARED_MASK0_CLR_MICFIL_MASK_CLR_SHIFT (2U)
/*! MICFIL_MASK_CLR - MICFIL Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_MICFIL_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_MICFIL_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_MICFIL_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_LPI2C15_MASK_CLR_MASK (0x8U)
#define SLEEPCON0_SHARED_MASK0_CLR_LPI2C15_MASK_CLR_SHIFT (3U)
/*! LPI2C15_MASK_CLR - LPI2C15 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_LPI2C15_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_LPI2C15_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_LPI2C15_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_GDET3_MASK_CLR_MASK (0x20U)
#define SLEEPCON0_SHARED_MASK0_CLR_GDET3_MASK_CLR_SHIFT (5U)
/*! GDET3_MASK_CLR - GDET3 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_GDET3_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_GDET3_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_GDET3_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_RTC_MASK_CLR_MASK (0x40U)
#define SLEEPCON0_SHARED_MASK0_CLR_RTC_MASK_CLR_SHIFT (6U)
/*! RTC_MASK_CLR - RTC0 and RTC1 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_RTC_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_RTC_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_RTC_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_VGPU_MASK_CLR_MASK (0x10000U)
#define SLEEPCON0_SHARED_MASK0_CLR_VGPU_MASK_CLR_SHIFT (16U)
/*! VGPU_MASK_CLR - VGPU Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_VGPU_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_VGPU_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_VGPU_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_EZHV_MASK_CLR_MASK (0x20000U)
#define SLEEPCON0_SHARED_MASK0_CLR_EZHV_MASK_CLR_SHIFT (17U)
/*! EZHV_MASK_CLR - EZH-V Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_EZHV_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_EZHV_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_EZHV_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_XSPI2_MASK_CLR_MASK (0x40000U)
#define SLEEPCON0_SHARED_MASK0_CLR_XSPI2_MASK_CLR_SHIFT (18U)
/*! XSPI2_MASK_CLR - XSPI2 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_XSPI2_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_XSPI2_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_XSPI2_MASK_CLR_MASK)

#define SLEEPCON0_SHARED_MASK0_CLR_LPSPI14_MASK_CLR_MASK (0x80000U)
#define SLEEPCON0_SHARED_MASK0_CLR_LPSPI14_MASK_CLR_SHIFT (19U)
/*! LPSPI14_MASK_CLR - LPSPI14 Mask Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_SHARED_MASK0_CLR_LPSPI14_MASK_CLR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHARED_MASK0_CLR_LPSPI14_MASK_CLR_SHIFT)) & SLEEPCON0_SHARED_MASK0_CLR_LPSPI14_MASK_CLR_MASK)

