Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
/*! @name PRIVATE_TCTRL1 - Private Resources Targets Low-power Control 1 */
/*! @{ */

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM0_F_LPREQ_MASK (0x1U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM0_F_LPREQ_SHIFT (0U)
/*! LP_FLEXCOMM0_F_LPREQ - LP_FLEXCOMM0 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM0_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM0_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM0_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM1_F_LPREQ_MASK (0x2U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM1_F_LPREQ_SHIFT (1U)
/*! LP_FLEXCOMM1_F_LPREQ - LP_FLEXCOMM1 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM1_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM1_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM1_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM2_F_LPREQ_MASK (0x4U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM2_F_LPREQ_SHIFT (2U)
/*! LP_FLEXCOMM2_F_LPREQ - LP_FLEXCOMM2 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM2_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM2_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM2_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM3_F_LPREQ_MASK (0x8U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM3_F_LPREQ_SHIFT (3U)
/*! LP_FLEXCOMM3_F_LPREQ - LP_FLEXCOMM3 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM3_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM3_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM3_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM4_F_LPREQ_MASK (0x10U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM4_F_LPREQ_SHIFT (4U)
/*! LP_FLEXCOMM4_F_LPREQ - LP_FLEXCOMM4 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM4_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM4_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM4_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM5_F_LPREQ_MASK (0x20U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM5_F_LPREQ_SHIFT (5U)
/*! LP_FLEXCOMM5_F_LPREQ - LP_FLEXCOMM5 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM5_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM5_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM5_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM6_F_LPREQ_MASK (0x40U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM6_F_LPREQ_SHIFT (6U)
/*! LP_FLEXCOMM6_F_LPREQ - LP_FLEXCOMM6 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM6_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM6_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM6_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM7_F_LPREQ_MASK (0x80U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM7_F_LPREQ_SHIFT (7U)
/*! LP_FLEXCOMM7_F_LPREQ - LP_FLEXCOMM7 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM7_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM7_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM7_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM8_F_LPREQ_MASK (0x100U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM8_F_LPREQ_SHIFT (8U)
/*! LP_FLEXCOMM8_F_LPREQ - LP_FLEXCOMM8 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM8_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM8_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM8_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM9_F_LPREQ_MASK (0x200U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM9_F_LPREQ_SHIFT (9U)
/*! LP_FLEXCOMM9_F_LPREQ - LP_FLEXCOMM9 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM9_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM9_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM9_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM10_F_LPREQ_MASK (0x400U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM10_F_LPREQ_SHIFT (10U)
/*! LP_FLEXCOMM10_F_LPREQ - LP_FLEXCOMM10 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM10_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM10_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM10_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM11_F_LPREQ_MASK (0x800U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM11_F_LPREQ_SHIFT (11U)
/*! LP_FLEXCOMM11_F_LPREQ - LP_FLEXCOMM11 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM11_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM11_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM11_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM12_F_LPREQ_MASK (0x1000U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM12_F_LPREQ_SHIFT (12U)
/*! LP_FLEXCOMM12_F_LPREQ - LP_FLEXCOMM12 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM12_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM12_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM12_F_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM13_F_LPREQ_MASK (0x2000U)
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM13_F_LPREQ_SHIFT (13U)
/*! LP_FLEXCOMM13_F_LPREQ - LP_FLEXCOMM13 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM13_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM13_F_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL1_LP_FLEXCOMM13_F_LPREQ_MASK)
/*! @} */

/*! @name PRIVATE_TCTRL2 - Private Resources Targets Low-power Control 2 */
/*! @{ */

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO0_LPREQ_MASK (0x1U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO0_LPREQ_SHIFT (0U)
/*! GPIO0_LPREQ - GPIO0 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO0_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO0_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO0_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO1_LPREQ_MASK (0x2U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO1_LPREQ_SHIFT (1U)
/*! GPIO1_LPREQ - GPIO1 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO1_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO1_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO1_LPREQ_MASK)

