Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO2_LPREQ_MASK (0x4U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO2_LPREQ_SHIFT (2U)
/*! GPIO2_LPREQ - GPIO2 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO2_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO2_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO2_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO3_LPREQ_MASK (0x8U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO3_LPREQ_SHIFT (3U)
/*! GPIO3_LPREQ - GPIO3 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO3_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO3_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO3_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO4_LPREQ_MASK (0x10U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO4_LPREQ_SHIFT (4U)
/*! GPIO4_LPREQ - GPIO4 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO4_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO4_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO4_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO5_LPREQ_MASK (0x20U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO5_LPREQ_SHIFT (5U)
/*! GPIO5_LPREQ - GPIO5 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO5_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO5_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO5_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO6_LPREQ_MASK (0x40U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO6_LPREQ_SHIFT (6U)
/*! GPIO6_LPREQ - GPIO6 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO6_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO6_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO6_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GPIO7_LPREQ_MASK (0x80U)
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO7_LPREQ_SHIFT (7U)
/*! GPIO7_LPREQ - GPIO7 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GPIO7_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GPIO7_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GPIO7_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ_MASK (0x100U)
#define SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ_SHIFT (8U)
/*! SAI0_LPREQ - SAI0 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_SAI0_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ_MASK (0x200U)
#define SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ_SHIFT (9U)
/*! SAI1_LPREQ - SAI1 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_SAI1_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ_MASK (0x400U)
#define SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ_SHIFT (10U)
/*! SAI2_LPREQ - SAI2 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_SAI2_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_TRNG_STOP_MASK  (0x800U)
#define SLEEPCON0_PRIVATE_TCTRL2_TRNG_STOP_SHIFT (11U)
/*! TRNG_STOP - TRNG Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_TRNG_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_TRNG_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_TRNG_STOP_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_XSPI0_STOP_MASK (0x1000U)
#define SLEEPCON0_PRIVATE_TCTRL2_XSPI0_STOP_SHIFT (12U)
/*! XSPI0_STOP - XSPI0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_XSPI0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_XSPI0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_XSPI0_STOP_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_XSPI1_STOP_MASK (0x4000U)
#define SLEEPCON0_PRIVATE_TCTRL2_XSPI1_STOP_SHIFT (14U)
/*! XSPI1_STOP - XSPI1 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_XSPI1_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_XSPI1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_XSPI1_STOP_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_I3C0_STOP_MASK  (0x10000U)
#define SLEEPCON0_PRIVATE_TCTRL2_I3C0_STOP_SHIFT (16U)
/*! I3C0_STOP - I3C0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_I3C0_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_I3C0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_I3C0_STOP_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_I3C1_STOP_MASK  (0x20000U)
#define SLEEPCON0_PRIVATE_TCTRL2_I3C1_STOP_SHIFT (17U)
/*! I3C1_STOP - I3C1 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_I3C1_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_I3C1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_I3C1_STOP_MASK)

#define SLEEPCON0_PRIVATE_TCTRL2_GDET0_LPREQ_MASK (0x40000U)
#define SLEEPCON0_PRIVATE_TCTRL2_GDET0_LPREQ_SHIFT (18U)
/*! GDET0_LPREQ - GDET0 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL2_GDET0_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL2_GDET0_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL2_GDET0_LPREQ_MASK)
/*! @} */

/*! @name SHA_MED_CSTAT0 - Media Domain Shared Controllers Low-power Status */
/*! @{ */

#define SLEEPCON0_SHA_MED_CSTAT0_VGPU_LPACCEPT_MASK (0x1U)
#define SLEEPCON0_SHA_MED_CSTAT0_VGPU_LPACCEPT_SHIFT (0U)
/*! VGPU_LPACCEPT - VGPU Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_SHA_MED_CSTAT0_VGPU_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MED_CSTAT0_VGPU_LPACCEPT_SHIFT)) & SLEEPCON0_SHA_MED_CSTAT0_VGPU_LPACCEPT_MASK)

