Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_B_LPACCEPT_MASK (0x40U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_B_LPACCEPT_SHIFT (6U)
/*! LP_FLEXCOMM6_B_LPACCEPT - LP_FLEXCOMM6 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_B_LPACCEPT_MASK (0x80U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_B_LPACCEPT_SHIFT (7U)
/*! LP_FLEXCOMM7_B_LPACCEPT - LP_FLEXCOMM7 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_B_LPACCEPT_MASK (0x100U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_B_LPACCEPT_SHIFT (8U)
/*! LP_FLEXCOMM8_B_LPACCEPT - LP_FLEXCOMM8 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_B_LPACCEPT_MASK (0x200U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_B_LPACCEPT_SHIFT (9U)
/*! LP_FLEXCOMM9_B_LPACCEPT - LP_FLEXCOMM9 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_B_LPACCEPT_MASK (0x400U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_B_LPACCEPT_SHIFT (10U)
/*! LP_FLEXCOMM10_B_LPACCEPT - LP_FLEXCOMM10 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_B_LPACCEPT_MASK (0x800U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_B_LPACCEPT_SHIFT (11U)
/*! LP_FLEXCOMM11_B_LPACCEPT - LP_FLEXCOMM11 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_B_LPACCEPT_MASK (0x1000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_B_LPACCEPT_SHIFT (12U)
/*! LP_FLEXCOMM12_B_LPACCEPT - LP_FLEXCOMM12 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_B_LPACCEPT_MASK (0x2000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_B_LPACCEPT_SHIFT (13U)
/*! LP_FLEXCOMM13_B_LPACCEPT - LP_FLEXCOMM13 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_F_LPACCEPT_MASK (0x10000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_F_LPACCEPT_SHIFT (16U)
/*! LP_FLEXCOMM0_F_LPACCEPT - LP_FLEXCOMM0 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_F_LPACCEPT_MASK (0x20000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_F_LPACCEPT_SHIFT (17U)
/*! LP_FLEXCOMM1_F_LPACCEPT - LP_FLEXCOMM1 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_F_LPACCEPT_MASK (0x40000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_F_LPACCEPT_SHIFT (18U)
/*! LP_FLEXCOMM2_F_LPACCEPT - LP_FLEXCOMM2 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_F_LPACCEPT_MASK (0x80000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_F_LPACCEPT_SHIFT (19U)
/*! LP_FLEXCOMM3_F_LPACCEPT - LP_FLEXCOMM3 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_F_LPACCEPT_MASK (0x100000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_F_LPACCEPT_SHIFT (20U)
/*! LP_FLEXCOMM4_F_LPACCEPT - LP_FLEXCOMM4 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_F_LPACCEPT_MASK (0x200000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_F_LPACCEPT_SHIFT (21U)
/*! LP_FLEXCOMM5_F_LPACCEPT - LP_FLEXCOMM5 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_F_LPACCEPT_MASK (0x400000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_F_LPACCEPT_SHIFT (22U)
/*! LP_FLEXCOMM6_F_LPACCEPT - LP_FLEXCOMM6 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM6_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_F_LPACCEPT_MASK (0x800000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_F_LPACCEPT_SHIFT (23U)
/*! LP_FLEXCOMM7_F_LPACCEPT - LP_FLEXCOMM7 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM7_F_LPACCEPT_MASK)

