Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_F_LPACCEPT_MASK (0x1000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_F_LPACCEPT_SHIFT (24U)
/*! LP_FLEXCOMM8_F_LPACCEPT - LP_FLEXCOMM8 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM8_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_F_LPACCEPT_MASK (0x2000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_F_LPACCEPT_SHIFT (25U)
/*! LP_FLEXCOMM9_F_LPACCEPT - LP_FLEXCOMM9 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM9_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_F_LPACCEPT_MASK (0x4000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_F_LPACCEPT_SHIFT (26U)
/*! LP_FLEXCOMM10_F_LPACCEPT - LP_FLEXCOMM10 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM10_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_F_LPACCEPT_MASK (0x8000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_F_LPACCEPT_SHIFT (27U)
/*! LP_FLEXCOMM11_F_LPACCEPT - LP_FLEXCOMM11 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM11_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_F_LPACCEPT_MASK (0x10000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_F_LPACCEPT_SHIFT (28U)
/*! LP_FLEXCOMM12_F_LPACCEPT - LP_FLEXCOMM12 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM12_F_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_F_LPACCEPT_MASK (0x20000000U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_F_LPACCEPT_SHIFT (29U)
/*! LP_FLEXCOMM13_F_LPACCEPT - LP_FLEXCOMM13 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_F_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM13_F_LPACCEPT_MASK)
/*! @} */

/*! @name PRIVATE_TSTAT1 - Private Resources Targets Low-power Status 1 */
/*! @{ */

#define SLEEPCON0_PRIVATE_TSTAT1_GDET0_LPACCEPT_MASK (0x1U)
#define SLEEPCON0_PRIVATE_TSTAT1_GDET0_LPACCEPT_SHIFT (0U)
/*! GDET0_LPACCEPT - GDET0 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GDET0_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GDET0_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GDET0_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO0_LPACCEPT_MASK (0x4U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO0_LPACCEPT_SHIFT (2U)
/*! GPIO0_LPACCEPT - GPIO0 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO0_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO0_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO0_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO1_LPACCEPT_MASK (0x8U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO1_LPACCEPT_SHIFT (3U)
/*! GPIO1_LPACCEPT - GPIO1 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO1_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO1_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO1_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO2_LPACCEPT_MASK (0x10U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO2_LPACCEPT_SHIFT (4U)
/*! GPIO2_LPACCEPT - GPIO2 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO2_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO2_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO2_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO3_LPACCEPT_MASK (0x20U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO3_LPACCEPT_SHIFT (5U)
/*! GPIO3_LPACCEPT - GPIO3 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO3_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO3_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO3_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO4_LPACCEPT_MASK (0x40U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO4_LPACCEPT_SHIFT (6U)
/*! GPIO4_LPACCEPT - GPIO4 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO4_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO4_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO4_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO5_LPACCEPT_MASK (0x80U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO5_LPACCEPT_SHIFT (7U)
/*! GPIO5_LPACCEPT - GPIO5 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO5_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO5_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO5_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO6_LPACCEPT_MASK (0x100U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO6_LPACCEPT_SHIFT (8U)
/*! GPIO6_LPACCEPT - GPIO6 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO6_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO6_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO6_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_GPIO7_LPACCEPT_MASK (0x200U)
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO7_LPACCEPT_SHIFT (9U)
/*! GPIO7_LPACCEPT - GPIO7 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_GPIO7_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_GPIO7_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_GPIO7_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT_MASK (0x400U)
#define SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT_SHIFT (10U)
/*! SAI0_LPACCEPT - SAI0 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_SAI0_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT_MASK (0x800U)
#define SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT_SHIFT (11U)
/*! SAI1_LPACCEPT - SAI1 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_SAI1_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT_MASK (0x1000U)
#define SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT_SHIFT (12U)
/*! SAI2_LPACCEPT - SAI2 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_SAI2_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_TRNG_STOP_MASK  (0x2000U)
#define SLEEPCON0_PRIVATE_TSTAT1_TRNG_STOP_SHIFT (13U)
/*! TRNG_STOP - TRNG Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_TSTAT1_TRNG_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_TRNG_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_TRNG_STOP_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_XSPI0_STOP_MASK (0x4000U)
#define SLEEPCON0_PRIVATE_TSTAT1_XSPI0_STOP_SHIFT (14U)
/*! XSPI0_STOP - XSPI0 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_TSTAT1_XSPI0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_XSPI0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_XSPI0_STOP_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_XSPI1_STOP_MASK (0x8000U)
#define SLEEPCON0_PRIVATE_TSTAT1_XSPI1_STOP_SHIFT (15U)
/*! XSPI1_STOP - XSPI1 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_TSTAT1_XSPI1_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_XSPI1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_XSPI1_STOP_MASK)

#define SLEEPCON0_PRIVATE_TSTAT1_I3C0_STOP_MASK  (0x10000U)
#define SLEEPCON0_PRIVATE_TSTAT1_I3C0_STOP_SHIFT (16U)
/*! I3C0_STOP - I3C0 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_TSTAT1_I3C0_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_I3C0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_I3C0_STOP_MASK)

