Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT_MASK     (0x10U)
#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT_SHIFT    (4U)
/*! GPIO4_LPHINT - GPIO4 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO4_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO4_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT_MASK     (0x20U)
#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT_SHIFT    (5U)
/*! GPIO5_LPHINT - GPIO5 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO5_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO5_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT_MASK     (0x40U)
#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT_SHIFT    (6U)
/*! GPIO6_LPHINT - GPIO6 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO6_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO6_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT_MASK     (0x80U)
#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT_SHIFT    (7U)
/*! GPIO7_LPHINT - GPIO7 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO7_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO7_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_MASK    (0x100U)
#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_SHIFT   (8U)
/*! SAI0_B_LPHINT - SAI0 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_MASK    (0x200U)
#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_SHIFT   (9U)
/*! SAI1_B_LPHINT - SAI1 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_MASK    (0x400U)
#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_SHIFT   (10U)
/*! SAI2_B_LPHINT - SAI2 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_MASK    (0x800U)
#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_SHIFT   (11U)
/*! SAI0_F_LPHINT - SAI0 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_MASK    (0x1000U)
#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_SHIFT   (12U)
/*! SAI1_F_LPHINT - SAI1 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_MASK    (0x2000U)
#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_SHIFT   (13U)
/*! SAI2_F_LPHINT - SAI2 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_MASK  (0x4000U)
#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_SHIFT (14U)
/*! FLEXIO_B_LPHINT - FLEXIO Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_MASK (0x8000U)
#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_SHIFT (15U)
/*! LPI2C15_B_LPHINT - LPI2C15 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_MASK  (0x10000U)
#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_SHIFT (16U)
/*! FLEXIO_F_LPHINT - FLEXIO Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_MASK (0x20000U)
#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_SHIFT (17U)
/*! LPI2C15_F_LPHINT - LPI2C15 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_NIC0_IDLE0_MASK       (0x40000U)
#define SLEEPCON0_LP_HINT1_NIC0_IDLE0_SHIFT      (18U)
/*! NIC0_IDLE0 - NIC_MEDIA0 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC0_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC0_IDLE0_SHIFT)) & SLEEPCON0_LP_HINT1_NIC0_IDLE0_MASK)

#define SLEEPCON0_LP_HINT1_NIC0_IDLE1_MASK       (0x80000U)
#define SLEEPCON0_LP_HINT1_NIC0_IDLE1_SHIFT      (19U)
/*! NIC0_IDLE1 - NIC_MEDIA0 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC0_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC0_IDLE1_SHIFT)) & SLEEPCON0_LP_HINT1_NIC0_IDLE1_MASK)

#define SLEEPCON0_LP_HINT1_NIC1_IDLE0_MASK       (0x100000U)
#define SLEEPCON0_LP_HINT1_NIC1_IDLE0_SHIFT      (20U)
/*! NIC1_IDLE0 - NIC_MEDIA1 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC1_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC1_IDLE0_SHIFT)) & SLEEPCON0_LP_HINT1_NIC1_IDLE0_MASK)

#define SLEEPCON0_LP_HINT1_NIC1_IDLE1_MASK       (0x200000U)
#define SLEEPCON0_LP_HINT1_NIC1_IDLE1_SHIFT      (21U)
/*! NIC1_IDLE1 - NIC_MEDIA1 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC1_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC1_IDLE1_SHIFT)) & SLEEPCON0_LP_HINT1_NIC1_IDLE1_MASK)
/*! @} */

