Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_SLEEPCON0.h
/*! @name LP_DENY0 - Low-Power Request Deny Status 0 */
/*! @{ */

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_MASK (0x1U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_SHIFT (0U)
/*! LP_FLEXCOMM0_LPDENY - LP_FLEXCOMM0 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_MASK (0x2U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_SHIFT (1U)
/*! LP_FLEXCOMM1_LPDENY - LP_FLEXCOMM1 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_MASK (0x4U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_SHIFT (2U)
/*! LP_FLEXCOMM2_LPDENY - LP_FLEXCOMM2 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_MASK (0x8U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_SHIFT (3U)
/*! LP_FLEXCOMM3_LPDENY - LP_FLEXCOMM3 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_MASK (0x10U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_SHIFT (4U)
/*! LP_FLEXCOMM4_LPDENY - LP_FLEXCOMM4 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_MASK (0x20U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_SHIFT (5U)
/*! LP_FLEXCOMM5_LPDENY - LP_FLEXCOMM5 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_MASK (0x40U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_SHIFT (6U)
/*! LP_FLEXCOMM6_LPDENY - LP_FLEXCOMM6 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM7_LPDENY_MASK (0x80U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM7_LPDENY_SHIFT (7U)
/*! LP_FLEXCOMM7_LPDENY - LP_FLEXCOMM7 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM7_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM7_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM7_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM8_LPDENY_MASK (0x100U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM8_LPDENY_SHIFT (8U)
/*! LP_FLEXCOMM8_LPDENY - LP_FLEXCOMM8 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM8_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM8_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM8_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM9_LPDENY_MASK (0x200U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM9_LPDENY_SHIFT (9U)
/*! LP_FLEXCOMM9_LPDENY - LP_FLEXCOMM9 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM9_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM9_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM9_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM10_LPDENY_MASK (0x400U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM10_LPDENY_SHIFT (10U)
/*! LP_FLEXCOMM10_LPDENY - LP_FLEXCOMM10 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM10_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM10_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM10_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM11_LPDENY_MASK (0x800U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM11_LPDENY_SHIFT (11U)
/*! LP_FLEXCOMM11_LPDENY - LP_FLEXCOMM11 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM11_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM11_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM11_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM12_LPDENY_MASK (0x1000U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM12_LPDENY_SHIFT (12U)
/*! LP_FLEXCOMM12_LPDENY - LP_FLEXCOMM12 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM12_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM12_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM12_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM13_LPDENY_MASK (0x2000U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM13_LPDENY_SHIFT (13U)
/*! LP_FLEXCOMM13_LPDENY - LP_FLEXCOMM13 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM13_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM13_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM13_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LPSPI14_LPDENY_MASK   (0x4000U)
#define SLEEPCON0_LP_DENY0_LPSPI14_LPDENY_SHIFT  (14U)
/*! LPSPI14_LPDENY - LPSPI14 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LPSPI14_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LPSPI14_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LPSPI14_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LPSPI16_LPDENY_MASK   (0x8000U)
#define SLEEPCON0_LP_DENY0_LPSPI16_LPDENY_SHIFT  (15U)
/*! LPSPI16_LPDENY - LPSPI16 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LPSPI16_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LPSPI16_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LPSPI16_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_FLEXIO_LPDENY_MASK    (0x10000U)
#define SLEEPCON0_LP_DENY0_FLEXIO_LPDENY_SHIFT   (16U)
/*! FLEXIO_LPDENY - FLEXIO Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_FLEXIO_LPDENY(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_FLEXIO_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_FLEXIO_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LPI2C15_LPDENY_MASK   (0x20000U)
#define SLEEPCON0_LP_DENY0_LPI2C15_LPDENY_SHIFT  (17U)
/*! LPI2C15_LPDENY - LPI2C15 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LPI2C15_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LPI2C15_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LPI2C15_LPDENY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SLEEPCON0_Register_Masks */


/*!
 * @}
 */ /* end of group SLEEPCON0_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SLEEPCON0_H_ */

